{
  "user": "user3",
  "countries": ["Australia"],
  "title": "Down Under",
  "description": "An adventurous trip across Australia's east coast, filled with natural wonders and vibrant cities.",
  "startDate": "2024-08-01T00:00:00Z",
  "endDate": "2024-08-14T00:00:00Z",
  "budget": 3500,
  "currency": "AUD",
  "locations": [
    {
      "country": "Australia",
      "city": "Sydney",
      "startDate": "2024-08-01T00:00:00Z",
      "endDate": "2024-08-05T00:00:00Z",
      "story": "Sydney was my first stop in Australia, and it did not disappoint. The Sydney Opera House was as impressive in person as it is in photos. I spent an afternoon walking across the Sydney Harbour Bridge and taking in the panoramic views of the city and the harbor. Bondi Beach was a highlight—beautiful blue waters and golden sand made it the perfect place to relax. The city’s mix of modern architecture and natural beauty left a lasting impression, and I was eager to explore more of the country.",
      "cost": 1000,
      "currency": "AUD",
      "photos": []
    },
    {
      "country": "Australia",
      "city": "Brisbane",
      "startDate": "2024-08-06T00:00:00Z",
      "endDate": "2024-08-09T00:00:00Z",
      "story": "Brisbane was a slower-paced stop compared to Sydney, but it had its own charm. The city’s location along the Brisbane River made for beautiful riverside walks. I visited the Lone Pine Koala Sanctuary, where I got to see Australian wildlife up close. The city’s cultural scene was thriving, with many art galleries and museums to explore. Brisbane felt like a city that blended urban life with a connection to nature, making it the perfect balance of activity and relaxation.",
      "cost": 700,
      "currency": "AUD",
      "photos": []
    }
  ],
  "routes": [
    {
      "origin": "Sydney",
      "destination": "Brisbane",
      "transportType": "Flight",
      "duration": 90,
      "note": "A quick flight between the cities.",
      "cost": 300,
      "currency": "AUD"
    }
  ]
}